#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_nrql_alert_condition.garden_tour_pwa_javascript_errors will be created
  + resource "newrelic_nrql_alert_condition" "garden_tour_pwa_javascript_errors" {
      + account_id                   = 3248905
      + aggregation_method           = "event_timer"
      + aggregation_timer            = "60"
      + aggregation_window           = 60
      + description                  = <<-EOT
            JavaScript Errors are high
        EOT
      + enabled                      = true
      + entity_guid                  = (known after apply)
      + id                           = (known after apply)
      + name                         = "Garden Tour PWA Error Rate"
      + policy_id                    = 3921296
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200

      + critical {
          + operator              = "above"
          + threshold             = 5
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + query = "SELECT (filter(count(newrelic.timeslice.value), WHERE metricTimesliceName = 'EndUser/errors') / filter(count(newrelic.timeslice.value), WHERE metricTimesliceName = 'Browser')) as 'Javascript error rate' FROM Metric WHERE (entityGuid = 'MzI0ODkwNXxCUk9XU0VSfEFQUExJQ0FUSU9OfDExMjAxMzMzNDI')"
        }

      + warning {
          + operator              = "above"
          + threshold             = 1
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Fallenstedt, Action: `pull_request`, Workflow: `Terraform Plan`*